Revit 2026 API

# HiddenLineViewsType Enumeration

---

An enumerated type listing all Hidden Line Views types of Print Setting.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum HiddenLineViewsType
```
```vb
Public Enumeration HiddenLineViewsType
```
```cpp
public enum class HiddenLineViewsType
```
```fsharp
type HiddenLineViewsType
```

| Member name | Value | Description |
| --- | --- | --- |
| RasterProcessing | 1 | The type of Hidden Line Views is Raster Processing. |
| VectorProcessing | 0 | The type of Hidden Line Views is Vector Processing (fast). |

#### Reference

Autodesk.Revit.DB Namespace